import math
a = float(input("Введите a: "))
b = float(input("Введите b: "))
c = float(input("Введите c: "))
#Решение квадратного уравнения либо вывод некорректного ввода
if a == 0:
    print("Это не квадратное уравнение")
else:
    D = b**2 - 4*a*c
#Нахождение корней уравнения и их вывод с фиксированной точкой и количеством знаков после запятой
    if D > 0:
        x1 = (-b + math.sqrt(D)) / (2*a)
        x2 = (-b - math.sqrt(D)) / (2*a)
        print(f"Два корня: x1 = {x1:.2f}, x2 = {x2:.2f}")
    elif D == 0:
        x = -b / (2*a)
        print(f"Один корень: x = {x:.2f}")
    else:
        print("Нет действительных корней")
